import React from 'react';

const Question = () => {
    return (
        <div className='question'>
            <h2>Three Answer Of Question</h2>
            <div className="">
                <h4>1. How Does React Work.?</h4>
                <p>ক্লায়েন্ট-সাইড অ্যাপস তৈরি করার সময়, Facebook ডেভেলপারদের একটি দল বুঝতে পেরেছিল যে DOM ধীর, এটিকে দ্রুততর করতে, প্রতিক্রিয়া একটি ভার্চুয়াল DOM প্রয়োগ করে যা মূলত জাভাস্ক্রিপ্টে একটি DOM ট্রি উপস্থাপনা। তাই যখন এটি DOM-এ পড়তে বা লিখতে হবে, তখন এটি এর ভার্চুয়াল উপস্থাপনা ব্যবহার করবে। তারপর ভার্চুয়াল DOM ব্রাউজারের DOM আপডেট করার সবচেয়ে কার্যকর উপায় খুঁজে বের করার চেষ্টা করে।
                </p>
                <br />
                <h4>What Difference of Props and State..?</h4>
                <p>Props এক উপাদান থেকে অন্য উপাদানে ডেটা প্রেরণ করতে ব্যবহৃত হয়। State হল একটি স্থানীয় ডেটা সঞ্চয়স্থান যা শুধুমাত্র উপাদানগুলির জন্য স্থান তৈরি করে।</p>
                <br />
                <h4>useEffect ডাটা লোড করা ছাড়া কি কি কাজে ব্যবহার হয়?</h4>
                <p></p>
            </div>
        </div>
    );
};

export default Question;